{
    "news": [
        {
            "id": "0", 
            "title": "硕士研究生乔塬心在CCF C类国际会议SMC发表最新研究成果",
            "content": [
                {
                    "types": "text",
                    "info": "testtest" 
                },
                {
                    "types": "image",
                    "info": "SDA-FirmFuzz.png"
                }
            ],
            "date": "2024年7月11日",
            "graphicAbstract": "SDA-FirmFuzz.png"
        },
        {
            "id": "1", 
            "title": "硕士研究生张佳乐在CCF C类国际会议SMC发表最新研究成果",
            "content": [
                {
                    "types": "text",
                    "info": "testtest" 
                },
                {
                    "types": "image",
                    "info": "SDA-FirmFuzz.png"
                }
            ],
            "date": "2024年7月11日",
            "graphicAbstract": "SDA-FirmFuzz.png"
        },
        {
            "id": "2", 
            "title": "硕士研究生杨君在CCF C类国际会议SMC发表最新研究成果",
            "content": [
                {
                    "types": "text",
                    "info": "testtest" 
                },
                {
                    "types": "image",
                    "info": "SDA-FirmFuzz.png"
                }
            ],
            "date": "2024年7月11日",
            "graphicAbstract": "SDA-FirmFuzz.png"
        },
        {
            "id": "3", 
            "title": "硕士研究生仁森林在CCF C类国际会议SMC发表最新研究成果",
            "content": [
                {
                    "types": "text",
                    "info": "testtest" 
                },
                {
                    "types": "image",
                    "info": "SDA-FirmFuzz.png"
                }
            ],
            "date": "2024年7月11日",
            "graphicAbstract": "SDA-FirmFuzz.png"
        },
        {
            "id": "4", 
            "title": "硕士研究生杨君在CCF C类国际会议SMC发表最新研究成果",
            "content": [
                {
                    "types": "text",
                    "info": "testtest" 
                },
                {
                    "types": "image",
                    "info": "SDA-FirmFuzz.png"
                }
            ],
            "date": "2024年7月11日",
            "graphicAbstract": "SDA-FirmFuzz.png"
        },
        {
            "id": "5", 
            "title": "硕士研究生王正武在CCF C类国际会议SEKE发表最新研究成果",
            "content": [
                {
                    "types": "text",
                    "info": "In recent years, as the Internet of Things (IoT) devices have been widely used in many fields. There have been attackers taking advantage of the vulnerabilities that exist in the firmware to take control of the devices. As a result, it is important to ensure that the secure of the firmware. Fuzz testing techniques have been proposed for testing firmwares which significantly improved the efficiency of detecting vulnerabilities." 
                },
                {
                    "types": "text",
                    "info": "Existing firmware fuzz testing techniques mainly focused on the static analysis of firmware before fuzzing, improving the generality of emulation tools, and increasing emulation throughput to improve efficiency of fuzzing. In general, the quality of test cases (seeds) significantly affects the result of fuzz testing; and high-quality seeds can cover more edges and trigger more crashes."
                },
                {
                    "types": "text",
                    "info": "Therefore, this paper proposes a fuzz testing method SDA-FirmFuzz (Fuzz Testing IoT Device Firmware Based on Seed Differential Analysis) for IoT device firmwares base on seed differentiation analysis. By analyzing the difference of the seeds before fuzz testing, SDA-FirmFuzz enables the seeds with higher degree of difference are prioritized to be executed. Firstly, a similarity matrix of seeds is constructed based on the cosine similarities. Secondly, a weight matrix is obtained based on the similarity matrix calculation to obtain the similarity scores of the seeds. Finally, the seeds are reordered based on the similarity scores, after which a new seed queue is used to fuzzing the IoT device firmware."
                },
                {
                    "types": "image",
                    "info": "SDA-FirmFuzz.png"
                },
                {
                    "types": "text",
                    "info": "Experiments are carried out on six IoT device firmwares, and the experimental results show that SDA-FirmFuzz is able to cover 1.26 times more edges and trigger 32 more unique crashes than Firm-AFL on average."
                }
            ],
            "date": "2024年7月21日",
            "graphicAbstract": "SDA-FirmFuzz.png"
        }
    ]
}